** Finding all kanban boards

The idea is to search in the document for all the kanban-boards


this can be done using  =(kanban-search-forward-for-board)= .

1. sending in (point-min) we get to the start , then the fn will return first point.
   2. Using a lambda can we make use of closure?
      For example if we capture a plist and add to it, let me try.

#+begin_src emacs-lisp :transient t
  (defun capture-list-test (ref-list)
    "docstring"
    (lambda (val)
      (nconc ref-list (list val))
      ))

  (defun call-cap-for-list ()
    "docstring"
    (interactive)
    (let* (
           (my-list (list "a" "b"))
           (my-fn (capture-list-test my-list))
           )
      (progn
        (mapcar my-fn '("a" "b" "c"))
        my-list
        )))
#+end_src

#+RESULTS:
: call-cap-for-list


Good experiment!
However, in your code, the lambda closes over =ref-list=, but =nconc= does *not* alter =my-list= in =call-cap-for-list= as you might expect.

That’s because in Emacs Lisp (like most Lisps), =nconc= mutates /the last cons cell/ of its first argument (the list’s cdr), but since you passed =(list "a" "b")=, =my-list= is a fresh list each function call, and the closure does not update it in place for the outside scope. The closure just keeps its own reference.

*To actually capture changes, you should use a single mutable /data structure/, e.g. a list placed in a variable by reference. Or use =list= cell tricks.* For example:

#+begin_src elisp :lexical t
  (defun capture-list-test (ref-cell)
    (lambda (val)
      (setcdr ref-cell (append (cdr ref-cell) (list val)))))

  (defun call-cap-for-list ()
    (interactive)
    (let* ((my-list (list "d")) ; dummy head cell
           (my-fn (capture-list-test my-list)))
      (mapcar my-fn '("a" "b" "c"))
      (cdr my-list)
      ))
  ;; call-cap-for-list => ("a" "b" "c")
#+end_src

#+RESULTS:
: call-cap-for-list

In essence , i will create a list.
With points , where i can find the different kanban board in a file.

I have a function =kanban-search-forward-for-board=
which needs a pt and name and a fn.
If that function is

#+begin_src emacs-lisp :lexical t
  (defun store-points-fn (list-of-points)
    "Returns another function that stores points"
    (lambda ()
      (setcdr list-of-points (append (cdr list-of-points) (list (point))))
      ))



  (defun kanban-search-forward-for-board (pt name fn)
    "search forward for the dynamic board "
    (let* ((board-regexp (format "^#\\+BEGIN: %s" name)))
      (goto-char pt)
      (when (re-search-forward board-regexp nil t)
        (goto-char (match-beginning 0))
        (funcall fn)
        (point))))
#+end_src

#+RESULTS:
: kanban-search-forward-for-board

Now using =kanban-search-forward-for-board=

#+begin_src emacs-lisp :lexical t
  (progn
    (let* ((my-list (list nil))
           (store-fn (store-points-fn my-list))
           )
      (kanban-search-forward-for-board (point-min) "kanban" store-fn)
      my-list
      )
    )
#+end_src

#+RESULTS:
| nil | 25511 |

THis is exactly what i was hoping for.  Now to further extend this, we
will need to loop through the available places, fortunatly we ave a
=kanban-exec-fn-all-boards=, if we use this together with our newly
created function, we should have a list of all

#+begin_src emacs-lisp :lexical
  (let* ((my-list (list nil))
         (store-fn (store-points-fn my-list))
         )
    (progn
      (kanban-exec-fn-all-blocks store-fn)
      (cdr my-list)
    ))

#+end_src

#+RESULTS:
| 25928 | 26493 |
 YES! That work perfectly
Now this should be implemented in =kanban-find-boards=

(kanban-find-boards)


#+NAME: TEST
#+BEGIN: kanban :mirrored t :match calle :mirror nil
| DONE                   | TODO                                |
|------------------------+-------------------------------------|
| [[file:README.org::*Jump to board (suffix)][Jump to board (suffix)]] |                                     |
|                        | [[file:README.org::*add the heading to choices.][add the heading to choices.]]         |
|                        | [[file:README.org::*org element at point][org element at point]]                |
|                        | [[file:README.org::*Adding match property][Adding match property]]               |
|                        | [[file:README.org::*Making a inifix with board names...][Making a inifix with board names...]] |
#+END:





So what do we want to do with this? Well the idea is to
be able to refer to one (if there are several). Right now i only have their position.
But maybe they have a name? or do i want to add a name?
I want to choose which I want to jump to?
At this  point we can use =org-element-at-point= which returns the properties (and name)


** DONE Jump to board (suffix)
CLOSED: [2025-08-07 Thu 21:38]
Should be fairly easy to implement a interactive jump to a
position now..

So lets say we create a suffix, with choices, these choices are
obviously gotten from =kanban-find-boards= where we get a list of positions?

Maybe its I can use =competing-read=
lets try it out. =kanban-find-boards= returns a list of position.
This list needs first to be transformed to strings...




#+begin_src emacs-lisp :lexical
  (defun kanban-jump-to-position ()
  "Interactively jump to a kanban board position."
  (interactive)
  (let* ((positions (kanban-find-boards))            ; e.g. a list of symbols or numbers
         (candidates (mapcar #'prin1-to-string positions))
         (choice (completing-read "Jump to board: " candidates)))
    (goto-char (string-to-number choice))
    ))
#+end_src

This is all good and cozy, the only problem is that it looks awful.
At least i can do is use "board 1" "board 2" ..
For that we need a plist...

Lets first check out how this can be done
#+begin_src emacs-lisp :lexical
  (defun kanban-make-alist (board-number pos)
    "Create alist with number and position"
    (let ((linenr (line-number-at-pos pos)))
      (cons (format "Board #%d (line %d)" board-number linenr) pos)
    ))

  (defun kanban-create-seq (candidates)
    "create a sequence of all candidates"
    (number-sequence 1 (length candidates))
    )


  (defun kanban-jump-to-board ()
    "docstring"
    (interactive)
    (let* ((positions (kanban-find-boards)) ;Here we get all the position
           (candidates (cl-mapcar #'kanban-make-alist (kanban-create-seq positions) positions))

           (choice (completing-read "Jump to board" (mapcar #'car candidates)))
           (pos (cdr (assoc choice candidates)))
           )
      (message "Pos %d" pos)
      (goto-char pos)
      ))

(org-get-heading)
#+end_src

#+RESULTS:
: TODO Jump to board (suffix)

one slight change to this is to to have the org heading..
That would be pretty cool.. That has to wait..


** TODO Making a inifix with board names...


#+BEGIN: kanban :mirrored nil :match nil
| TODO                                | DONE                   |
|-------------------------------------+------------------------|
|                                     | [[file:README.org::*Jump to board (suffix)][Jump to board (suffix)]] |
| [[file:README.org::*add the heading to choices.][add the heading to choices.]]         |                        |
| [[file:README.org::*org element at point][org element at point]]                |                        |
|                                     | [[file:README.org::*Adding match property][Adding match property]]  |
|                                     | [[file:README.org::*Property update][Property update]]        |
| [[file:README.org::*No match][No match]]                            |                        |
| [[file:README.org::*Make sure][Make sure]]                           |                        |
| [[file:README.org::*Making a inifix with board names...][Making a inifix with board names...]] |                        |
#+END:

Bug fixing.
The first part is that we are sending =mirror= that is wrong it should be =:mirrored=
In [[file:kanban-transient.el::defun kanban-get-property-fn (property-name args][kanban-get-property-fn]] we use the =property-name= what we need to do is to get /switch/.
Though this is though, we need to remove the ~--.*=~
And make it a :mirrored




#+begin_src emacs-lisp
  (defun plist-to-string (plist)
    "Transform a plist into a string"
    (interactive "P")
    )


  (let* ((plist-str (concat ":mirror nil :match \"calle\""))
         (key (intern (concat ":" "match")))
         (val (intern "bajs"))

         (plist (car (read-from-string (concat "(" plist-str ")" ))))
         (updated (plist-put plist :match 'fisk))
         )
    (with-temp-buffer
      (prin1 plist (current-buffer))
      (buffer-string)
      )

    )

  ;; Maybe im doing this the wrong way.
  ;; Maybe evrything should be items, and then post-process the bloody thing.



#+end_src

#+RESULTS:
: (:mirror nil :match fisk)

